MikhailBerezhanov/MotionSensor/stm32f10x_Inits.c
/*==============================================================================
>File name:  	stm32f10x.c
>Brief:         source for Init periph functions of projectONE		
>Author:        LL
>Date:          07.05.2018
>Version:       1.0
==============================================================================*/

#include "stm32f10x_Inits.h"

USART_InitTypeDef USART2_InitStructure;

#ifdef DMA_USART2_EN
static char DMA_USART2_buffer[DMA_BUF_SIZE];
#endif

#ifdef DMA_USART1_EN
static char DMA_USART1_buffer[DMA_BUF_SIZE];
#endif


/*=================================================================================
------------------- INIT STM32 FUNCTIONS of MotionSensor project ------------------
=================================================================================*/


/**
  * @brief  Set clock freq of core to HSE 8 MHz (no PLL used)
  * @param  None
  * @retval None
  */
void SetSysClockToHSE(void)
{
    ErrorStatus HSEStartUpStatus;
 
    /* SYSCLK, HCLK, PCLK2 and PCLK1 configuration -----------------------------*/
    /* RCC system reset(for debug purpose) */
    RCC_DeInit();
 
    /* Enable HSE */
    RCC_HSEConfig(RCC_HSE_ON);
 
    /* Wait till HSE is ready */
    HSEStartUpStatus = RCC_WaitForHSEStartUp();
 
    if (HSEStartUpStatus == SUCCESS)
    {
        /* Enable Prefetch Buffer */
        //FLASH_PrefetchBufferCmd( FLASH_PrefetchBuffer_Enable);
 
        /* Flash 0 wait state */
        //FLASH_SetLatency( FLASH_Latency_0);
 
        /* HCLK = SYSCLK */
        RCC_HCLKConfig( RCC_SYSCLK_Div1);
 
        /* PCLK2 = HCLK */
        RCC_PCLK2Config( RCC_HCLK_Div1);
 
        /* PCLK1 = HCLK */
        RCC_PCLK1Config(RCC_HCLK_Div1);
 
        /* Select HSE as system clock source */
        RCC_SYSCLKConfig(RCC_SYSCLKSource_HSE);
 
        /* Wait till HSE is used as system clock source */
        while (RCC_GetSYSCLKSource() != 0x04)
        {
        }
    }
    else
    { /* If HSE fails to start-up, the application will have wrong clock configuration.
     User can add here some code to deal with this error */
 
        /* Go to infinite loop */
        while (1)
        {
        }
    }
}

/**
  * @brief  Set clock freq of core to 72 MHz (*9 PLL)
  * @param  None
  * @retval None
  */
void SetSysClockTo_72(void)
{
    ErrorStatus HSEStartUpStatus;
    /* SYSCLK, HCLK, PCLK2 and PCLK1 configuration */
    /* RCC system reset(for debug purpose) */
    RCC_DeInit();
 
    /* Enable HSE */
    RCC_HSEConfig( RCC_HSE_ON);
 
    /* Wait till HSE is ready */
    HSEStartUpStatus = RCC_WaitForHSEStartUp();
 
    if (HSEStartUpStatus == SUCCESS)
    {
        /* Enable Prefetch Buffer */
        //FLASH_PrefetchBufferCmd( FLASH_PrefetchBuffer_Enable);
 
        /* Flash 2 wait state */
        //FLASH_SetLatency( FLASH_Latency_2);
 
        /* HCLK = SYSCLK */
        RCC_HCLKConfig( RCC_SYSCLK_Div1);
 
        /* PCLK2 = HCLK */
        RCC_PCLK2Config( RCC_HCLK_Div1);
 
        /* PCLK1 = HCLK/2 */
        RCC_PCLK1Config( RCC_HCLK_Div2);
 
        /* PLLCLK = 8MHz * 9 = 72 MHz */
        RCC_PLLConfig(RCC_PLLSource_HSE_Div1, RCC_PLLMul_9);
 
        /* Enable PLL */
        RCC_PLLCmd( ENABLE);
 
        /* Wait till PLL is ready */
        while (RCC_GetFlagStatus(RCC_FLAG_PLLRDY) == RESET)
        {
        }
 
        /* Select PLL as system clock source */
        RCC_SYSCLKConfig( RCC_SYSCLKSource_PLLCLK);
 
        /* Wait till PLL is used as system clock source */
        while (RCC_GetSYSCLKSource() != 0x08)
        {
        }
    }
    else
    { /* If HSE fails to start-up, the application will have wrong clock configuration.
     User can add here some code to deal with this error */
 
        /* Go to infinite loop */
        while (1)
        {
        }
    }
}

/**
  * @brief  Initialize STM32's GPIOs 
  * @param  None
  * @retval None
  */
void GPIO_init(void)
{
	// Configure the GPIOs 
    GPIO_InitTypeDef GPIO_InitStructure;
	EXTI_InitTypeDef EXTI_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC | RCC_APB2Periph_GPIOB | RCC_APB2Periph_AFIO, ENABLE);
	
	/* PC13 LED pin */ 
	GPIO_InitStructure.GPIO_Pin = LED_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;	
    GPIO_Init(LED_PORT, &GPIO_InitStructure);
	GPIO_SetBits(LED_PORT,LED_PIN);		//turn led OFF
	
	/* PA0 DEBUG pin */
    
	GPIO_InitStructure.GPIO_Pin = DEBUG_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;	
    GPIO_Init(DEBUG_PORT, &GPIO_InitStructure);
	GPIO_ResetBits(DEBUG_PORT,DEBUG_PIN);
		
	/* PB1 BLE STATE input pin */
	GPIO_InitStructure.GPIO_Pin = BLE_STATE_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;	
    GPIO_Init(BLE_STATE_PORT, &GPIO_InitStructure);
	GPIO_ResetBits(BLE_STATE_PORT,BLE_STATE_PIN);
	/* Add IRQ vector to NVIC */
	/* PB1 is connected to EXTI_Line1, which has EXTI1_IRQn vector */
	NVIC_InitStructure.NVIC_IRQChannel = EXTI1_IRQn;
	/* Priority group 2: 0-3 PreempPriority levels, 0-3 SubPriority lvls */
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
    /* Set priority */
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	/* Set sub priority */
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
	/* Enable interrupt */
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	/* Add to NVIC */
	NVIC_Init(&NVIC_InitStructure);

	/* Tell system that you will use PB1 for EXTI_Line1 */
	GPIO_EXTILineConfig(GPIO_PortSourceGPIOB, GPIO_PinSource1);

	/* PB1 is connected to EXTI_Line1 */
	EXTI_InitStructure.EXTI_Line = EXTI_Line1;
	/* Enable interrupt */
	EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	/* Interrupt mode */
	EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	/* Triggers on rising and falling edge */
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
	/* Add to EXTI */
	EXTI_Init(&EXTI_InitStructure);
	
	
	/* PB0 (EXTI line 0) to recieve interrups DRDY from BMI160 */ 
    GPIO_InitStructure.GPIO_Pin = INT1_EXTI_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;	//PB.0 EXTI_LINE0
    GPIO_Init(INT1_EXTI_PORT, &GPIO_InitStructure);
	
	/* Add IRQ vector to NVIC */
	/* PB0 is connected to EXTI_Line0, which has EXTI0_IRQn vector */
	NVIC_InitStructure.NVIC_IRQChannel = EXTI0_IRQn;
	/* Set priority */
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;   //can be interrupted by 0 priority
	/* Set sub priority */
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	/* Enable interrupt */
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	/* Add to NVIC */
	NVIC_Init(&NVIC_InitStructure);

	/* Tell system that you will use PB0 for EXTI_Line0 */
	GPIO_EXTILineConfig(GPIO_PortSourceGPIOB, GPIO_PinSource0);

	/* PB0 is connected to EXTI_Line0 */
	EXTI_InitStructure.EXTI_Line = EXTI_Line0;
	/* Enable interrupt */
	EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	/* Interrupt mode */
	EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	/* Triggers on rising and falling edge */
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
	/* Add to EXTI */
	EXTI_Init(&EXTI_InitStructure);
}


/**
  * @brief  Initialize STM32's USART1 peripheral module
  * @param  None
  * @retval None
  */
#ifdef DMA_USART1_EN
/**
  * @brief   
  * @note   
  * @param  
  * @retval 
  */
void USART1_init(void)
{
    /* Enable USART1 and GPIOA clock */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1 | RCC_APB2Periph_GPIOA, ENABLE);
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
 
    /* DMA */
    DMA_InitTypeDef DMA_InitStruct;
    DMA_InitStruct.DMA_PeripheralBaseAddr = (uint32_t)&(USART1->DR);
    DMA_InitStruct.DMA_MemoryBaseAddr = (uint32_t)&DMA_USART1_buffer[0];
    DMA_InitStruct.DMA_DIR = DMA_DIR_PeripheralDST; //usart - destination
    DMA_InitStruct.DMA_BufferSize = sizeof(DMA_USART1_buffer);
    DMA_InitStruct.DMA_PeripheralInc = DMA_PeripheralInc_Disable;   // don't increment address of USART DaraRegister (DR)
    DMA_InitStruct.DMA_MemoryInc = DMA_MemoryInc_Enable;            //increment adress of buffer units
    DMA_InitStruct.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    DMA_InitStruct.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
    DMA_InitStruct.DMA_Mode = DMA_Mode_Normal;
    DMA_InitStruct.DMA_Priority = DMA_Priority_High;
    DMA_InitStruct.DMA_M2M = DMA_M2M_Disable;
    DMA_Init(DMA1_Channel4, &DMA_InitStruct);   //USART1_TX - 4th DMA channel
 
    /* NVIC Configuration */
    NVIC_InitTypeDef NVIC_InitStructure;
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
    /* Enable the USARTx Interrupt */
    NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
 
