MikhailBerezhanov/MotionSensor/stm32f10x_Inits.c
    /* Configure the GPIOs */
    GPIO_InitTypeDef GPIO_InitStructure;
 
    // Configure USART2 Tx (PA.02) as alternate function push-pull 
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
 
    // Configure USART2 Rx (PA.03) as input floating 
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
 
    /* Configure the USART2 */ 
 
    /* USART2 configuration ------------------------------------------------------*/
    /* USART2 configured as follow:
        - BaudRate = 115200 baud 921600 \\ 1382400 \\ 38400 - proging speed
        - Word Length = 8 Bits
        - One Stop Bit
        - No parity
        - Hardware flow control disabled (RTS and CTS signals)
        - Receive and transmit enabled
        - USART Clock disabled
        - USART CPOL: Clock is active low
        - USART CPHA: Data is captured on the middle
        - USART LastBit: The clock pulse of the last data bit is not output to
            the SCLK pin
     */
    USART2_InitStructure.USART_BaudRate = 921600; 
    USART2_InitStructure.USART_WordLength = USART_WordLength_8b;
    USART2_InitStructure.USART_StopBits = USART_StopBits_1;
    USART2_InitStructure.USART_Parity = USART_Parity_No;
    USART2_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    USART2_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
 
    USART_Init(USART2, &USART2_InitStructure);
 
    /* Enable USART2 */
    USART_Cmd(USART2, ENABLE);
 
    USART_DMACmd(USART2, USART_DMAReq_Tx, ENABLE);
    DMA_Cmd(DMA1_Channel7, ENABLE);
 
    //DMA_ITConfig(DMA1_Channel7, DMA_IT_TC, ENABLE);
    //NVIC_EnableIRQ(DMA1_Channel7_IRQn);
  
    /* Enable the USART1 Receive interrupt: this interrupt is generated when the
    USART2 receive data register is not empty */
    USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);
}

/**
  * @brief   
  * @note   
  * @param  
  * @retval 
  */
uint8_t USART2_SEND_DMA(volatile char *pbuf)	
{
    /* wait when DR bacomes empty (whole buffer will be transmitted) */
    while ((USART2->SR & USART_FLAG_TC) == (u16)RESET);
    
    strcpy(DMA_USART2_buffer, (char*)pbuf);
    /* Restart DMA Channel*/
    DMA_Cmd(DMA1_Channel7, DISABLE);
    DMA1_Channel7->CNDTR = strlen((char*)pbuf);
    DMA_Cmd(DMA1_Channel7, ENABLE);
return SUCCESS;
}

#else

/**
  * @brief   	USART2 initializing
  * @note    	USART2_InitStructure must be glodal cuz it is used in HC-05.c to show status	
  * @param  
  * @retval 	SUCCESS
  */
void USART2_init(void)
{
	// Enable USART2 
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
	
    // NVIC Configuration
    NVIC_InitTypeDef NVIC_InitStructure;
    // Enable the USART2 Interrupt 
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
    NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
    // Enable the USART1 Receive interrupt: this interrupt is generated when the
    // USART2 receive data register is not empty 
    USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);
	
	/**USART2 GPIO Configuration  
	PA2   ------> USART2_TX
	PA3   ------> USART2_RX 
	*/
    // Configure the GPIOs 
    GPIO_InitTypeDef GPIO_InitStructure;
 
    // Configure USART1 Tx (PA.02) as alternate function push-pull 
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
 
    // Configure USART2 Rx (PA.03) as input floating 
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
 
    // Configure the USART2  
    USART2_InitStructure.USART_BaudRate = 1382400;//921600;
    USART2_InitStructure.USART_WordLength = USART_WordLength_8b;
    USART2_InitStructure.USART_StopBits = USART_StopBits_1;
    USART2_InitStructure.USART_Parity = USART_Parity_No;
    USART2_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    USART2_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
    USART_Init(USART2, &USART2_InitStructure);
 
    // Enable USART2 
    USART_Cmd(USART2, ENABLE);	
}
#endif //USART2 init

/**
  * @brief   
  * @note   
  * @param  
  * @retval 
  */
uint8_t USART2_SEND(volatile char *pbuf)
{
    while (*pbuf)
    {
        USART_SendData(USART2, *pbuf++);
        while(USART_GetFlagStatus(USART2, USART_FLAG_TC) == RESET);	//wait whole transmission
    }
return SUCCESS;
}

/**
  * @brief  sending data via USART1 fast speed
  * @param  *pbuf - pointer at buf
  * @retval None
  */
__forceinline void USART_SENDoptimized (USART_TypeDef* USARTx, const char *pbuf)
{
    
    while (*pbuf)
    {
        USARTx->DR = (*pbuf++ & (uint16_t)0x01FF);
        while((USARTx->SR & USART_FLAG_TC) == RESET);	//wait whole transmission
    }
  
}

/**
  * @brief  initialize SPI2 at MASTER mode
  * @param  None
  * @retval None
  */
void SPI2_MASTER_init (void)
{
	SPI_I2S_DeInit(SPI2);

	RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
	
	//GPIO_DeInit(SPI_GPIO_PORT);
	
    GPIO_InitTypeDef PortSettings;
	
	/* MOSI and SCK */
    PortSettings.GPIO_Speed = GPIO_Speed_50MHz;		
    PortSettings.GPIO_Pin = SPI_MOSI_PIN | SPI_SCK_PIN;
    PortSettings.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(SPI_GPIO_PORT,&PortSettings);

	/* MISO */
	PortSettings.GPIO_Pin = SPI_MISO_PIN;				
	PortSettings.GPIO_Mode = GPIO_Mode_IN_FLOATING;			
	PortSettings.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(SPI_GPIO_PORT, &PortSettings);	
	
