MikhailBerezhanov/MotionSensor/stm32f10x_Inits.c
	/* NSS - CSB */
    PortSettings.GPIO_Speed = GPIO_Speed_50MHz;		
    PortSettings.GPIO_Pin =  BMI160_CSB_PIN;
    PortSettings.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_Init(SPI_GPIO_PORT,&PortSettings);
	GPIO_SetBits(SPI_GPIO_PORT,BMI160_CSB_PIN);
	/* PA1 CSB for BMM150 SPI intrf */
	PortSettings.GPIO_Pin = GPIO_Pin_1;
    PortSettings.GPIO_Mode = GPIO_Mode_Out_PP;
    PortSettings.GPIO_Speed = GPIO_Speed_50MHz;	
    GPIO_Init(GPIOA, &PortSettings);
	GPIO_SetBits(GPIOA,GPIO_Pin_1);
	
	SPI_InitTypeDef SPI;
	
	SPI_StructInit(&SPI);	//Fills each SPI_InitStruct member with its default value	
	
    SPI.SPI_Mode = SPI_Mode_Master;
    SPI.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_4; //(APB1 = 36 MHz) SCLK = 9 MHz
    SPI.SPI_Direction = SPI_Direction_2Lines_FullDuplex ;
    SPI.SPI_CPOL = SPI_CPOL_High;					//CPOL_High (1) - ????\_/?\_/?\_/?TTT , CPOL_Low (0) - ___/?\__/?\__/?\___
    SPI.SPI_CPHA = SPI_CPHA_2Edge;				//CPHA_2Edge(1) - ?????? ?????, 			 CPHA_1Edge(0) - ???????? ?????
    SPI.SPI_DataSize = SPI_DataSize_8b;
    SPI.SPI_FirstBit = SPI_FirstBit_MSB;
    SPI.SPI_NSS = SPI_NSS_Soft;
    SPI_Init(SPI2,&SPI);

    //SPI_NSSInternalSoftwareConfig(SPI2,SPI_NSSInternalSoft_Reset);
    SPI_Cmd(SPI2,ENABLE);
}

/**
  * @brief  send data via SPI2 (common method) 
  * @param  data - ???? ??? 2 ????? (16???) ?????? ??? ????????
  * @retval None
  */
void SPI_Send(uint16_t data) 
{
	SPI_I2S_SendData(SPI2, data);  // ???????? ???? ?????? ? ??????? ?? ????????
	while (SPI_I2S_GetFlagStatus(SPI2, SPI_I2S_FLAG_TXE) == RESET); // ????, ???????????? SPI_DR
}






